; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v12 ?v6)
             (pred_1 ?v10 ?v8)
             (pred_9 ?v12 ?v8)
             (pred_2 ?v1 ?v12 )
	     (pred_6 ?v12)
             (pred_11 ?v9)
             (pred_5 ?v10)
             (pred_3 ?v8)
             (pred_4 ?v12)
             (pred_10 ?v10)
             (pred_12 ?v12)
             (pred_7 ))



(:action op_1
:parameters (?v5 ?v7 ?v4 ?v13)
:precondition (and (pred_11 ?v5) (pred_11 ?v7) (pred_5 ?v4) (pred_3 ?v13)
          (pred_8 ?v5 ?v7) (pred_1 ?v4 ?v13)
                   (pred_9 ?v7 ?v13) (pred_6 ?v5) 
                   (pred_4 ?v7) (pred_10 ?v4))
:effect (and  (pred_12 ?v7) (not (pred_4 ?v7))))


(:action op_4
:parameters (?v5 ?v11)
:precondition (and (pred_11 ?v5) (pred_11 ?v11)
               (pred_6 ?v5) (pred_8 ?v5 ?v11) (pred_12 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v5))))

(:action op_3
:parameters (?v5 ?v4)
:precondition (and (pred_11 ?v5) (pred_5 ?v4) 
                  (pred_6 ?v5) (pred_2 ?v4 ?v5) (pred_7 ))
:effect (and (pred_10 ?v4)
   (not (pred_2 ?v4 ?v5)) (not (pred_7 ))))


(:action op_2
:parameters (?v5 ?v3 ?v2)
:precondition (and (pred_11 ?v5) (pred_5 ?v3) (pred_5 ?v2)
                  (pred_6 ?v5) (pred_10 ?v2) (pred_2 ?v3 ?v5))
:effect (and (pred_10 ?v3) (pred_2 ?v2 ?v5)
        (not (pred_10 ?v2)) (not (pred_2 ?v3 ?v5))))

(:action op_5
:parameters (?v5 ?v4)
:precondition (and (pred_11 ?v5) (pred_5 ?v4) 
                  (pred_6 ?v5) (pred_10 ?v4))
:effect (and (pred_7 ) (pred_2 ?v4 ?v5) (not (pred_10 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_15 obj_08 obj_05 obj_13 obj_18 obj_20 obj_11 obj_17 obj_16 obj_07 obj_09 obj_03 obj_01 obj_12 obj_14 obj_02
    obj_06 obj_10
    obj_04 obj_19
    )

    (:init
       (pred_7)

       (pred_11 obj_15)
       (pred_11 obj_08)
       (pred_11 obj_05)
       (pred_11 obj_13)
       (pred_11 obj_18)
       (pred_11 obj_20)
       (pred_11 obj_11)
       (pred_11 obj_17)
       (pred_11 obj_16)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_11 obj_12)
       (pred_11 obj_14)
       (pred_11 obj_02)
       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_19)

       (pred_8 obj_15 obj_18)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_08 obj_20)
       (pred_8 obj_08 obj_05)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_05 obj_11)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_08)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_15)
       (pred_8 obj_20 obj_07)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_08)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_11 obj_09)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_05)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_17 obj_03)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_16 obj_01)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_07 obj_12)
       (pred_8 obj_07 obj_09)
       (pred_8 obj_07 obj_20)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_09 obj_11)
       (pred_8 obj_09 obj_07)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_03 obj_17)
       (pred_8 obj_03 obj_09)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_01 obj_16)
       (pred_8 obj_12 obj_14)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_14 obj_12)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_02 obj_14)
       (pred_4 obj_03)
       (pred_4 obj_14)
       (pred_9  obj_03 obj_06)
       (pred_9  obj_14 obj_10)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_12 obj_11)
       (pred_12 obj_17)
       (pred_12 obj_16)
       (pred_12 obj_07)
       (pred_12 obj_09)
       (pred_12 obj_01)
       (pred_12 obj_12)
       (pred_12 obj_02)

       (pred_1  obj_04 obj_06)
       (pred_1  obj_19 obj_10)
       (pred_2 obj_04 obj_09)
       (pred_2 obj_19 obj_13)
       (pred_6 obj_01)
    )

    (:goal (and
       (pred_2 obj_04 obj_15)
    ))
(:constraints
  (always (not (pred_6 obj_07)))
)
)

; plan
1. (op_4 obj_01 obj_16)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_16)
   goals met: 0 of 1
2. (op_4 obj_16 obj_18)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_18)
   goals met: 0 of 1
3. (op_4 obj_18 obj_20)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_20)
   goals met: 0 of 1
4. (op_4 obj_20 obj_11)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_11)
   goals met: 0 of 1
5. (op_4 obj_11 obj_09)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_09)
   goals met: 0 of 1
6. (op_3 obj_09 obj_04)
   deleted: (pred_2 obj_04 obj_09) (pred_7)
   added: (pred_10 obj_04)
   goals met: 0 of 1
7. (op_4 obj_09 obj_11)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_11)
   goals met: 0 of 1
8. (op_4 obj_11 obj_05)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_05)
   goals met: 0 of 1
9. (op_4 obj_05 obj_08)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_08)
   goals met: 0 of 1
10. (op_4 obj_08 obj_15)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_15)
   goals met: 0 of 1
11. (op_5 obj_15 obj_04)
   deleted: (pred_10 obj_04)
   added: (pred_7) (pred_2 obj_04 obj_15)
   goals met: 1 of 1
